Tutorial/4.CounterFlowFlame.FTMCO/Allrun.FTMCO
#!/bin/sh
cd "${0%/*}" || exit 1

. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

application=$(getApplication)

properties="constant/physicalProperties"
PreprocessProperties="constant/physicalProperties.PP"

if [ ! -f "$PreprocessProperties" ]
then
    echo "Error: $PreprocessProperties does not exist."
    exit 1
fi

if [ ! -f constant/thermo.FTM ]
then
    echo "Error: constant/thermo.FTM does not exist."
    echo "Run ./Allprepare.FTM first."
    exit 1
fi

# Activate the FTM configuration
cp "$PreprocessProperties" "$properties"

sed -i \
    -e '/^[[:space:]]*usingCoTHERM[[:space:]]/s/false/true/' \
    -e '/^[[:space:]]*usingPreProcessingFTM[[:space:]]/s/true/false/' \
    -e '/^[[:space:]]*mixture[[:space:]]/s/DTMMulticomponentMixture/FTMMulticomponentMixture/' \
    -e '/^[[:space:]]*transport[[:space:]]/s/preprocessingFTMTransport/FTMTransport/' \
    -e '/^[[:space:]]*#include[[:space:]]/s/thermo.DTM/thermo.FTM/' \
    "$properties"

runApplication -o blockMesh
runApplication -o decomposePar
mpirun -np 4 "$application" -parallel
runApplication -o reconstructPar

#------------------------------------------------------------------------------
